cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst LdWIndexPart;
  LdWIndexPart.setOpcode(AVR32::LD_W_IndexPart);
  LdWIndexPart.addOperand(MCOperand::createReg(AVR32::R1));
  LdWIndexPart.addOperand(MCOperand::createReg(AVR32::R2));
  LdWIndexPart.addOperand(MCOperand::createReg(AVR32::R3));
  LdWIndexPart.addOperand(MCOperand::createImm(1));
  LdWIndexPart.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWIndexPart, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x91);

  MCInst LdWEqDisp9;
  LdWEqDisp9.setOpcode(AVR32::LD_W_EQ_Disp9);
  LdWEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdWEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdWEqDisp9.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdWAlDisp9;
  LdWAlDisp9.setOpcode(AVR32::LD_W_AL_Disp9);
  LdWAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdWAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdWAlDisp9.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xf0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdDPostInc;
  LdDPostInc.setOpcode(AVR32::LD_D_PostInc);
  LdDPostInc.addOperand(MCOperand::createReg(AVR32::R2));
  LdDPostInc.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdDPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);

  MCInst LdDPreDec;
  LdDPreDec.setOpcode(AVR32::LD_D_PreDec);
  LdDPreDec.addOperand(MCOperand::createReg(AVR32::R2));
  LdDPreDec.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdDPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x12);

  MCInst LdDReg;
  LdDReg.setOpcode(AVR32::LD_D_Reg);
  LdDReg.addOperand(MCOperand::createReg(AVR32::R2));
  LdDReg.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdDReg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);

  MCInst LdDDisp16;
  LdDDisp16.setOpcode(AVR32::LD_D_Disp16);
  LdDDisp16.addOperand(MCOperand::createReg(AVR32::R2));
  LdDDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  LdDDisp16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdDDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdDIndexShift;
  LdDIndexShift.setOpcode(AVR32::LD_D_IndexShift);
  LdDIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdDIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  LdDIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdDIndexShift.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x32);

  MCInst Lddpc;
  Lddpc.setOpcode(AVR32::LDDPC);
  Lddpc.addOperand(MCOperand::createReg(AVR32::R2));
  Lddpc.addOperand(MCOperand::createReg(AVR32::PC));
  Lddpc.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lddpc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x48);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst Lddsp;
  Lddsp.setOpcode(AVR32::LDDSP);
  Lddsp.addOperand(MCOperand::createReg(AVR32::R2));
  Lddsp.addOperand(MCOperand::createReg(AVR32::SP));
  Lddsp.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lddsp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst LdinsB;
  LdinsB.setOpcode(AVR32::LDINS_B);
  LdinsB.addOperand(MCOperand::createReg(AVR32::R1));
  LdinsB.addOperand(MCOperand::createImm(2));
  LdinsB.addOperand(MCOperand::createReg(AVR32::R2));
  LdinsB.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdinsB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x6f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdinsH;
  LdinsH.setOpcode(AVR32::LDINS_H);
  LdinsH.addOperand(MCOperand::createReg(AVR32::R1));
  LdinsH.addOperand(MCOperand::createImm(1));
  LdinsH.addOperand(MCOperand::createReg(AVR32::R2));
  LdinsH.addOperand(MCOperand::createImm(-2));

