cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream SatsOS(Printed);
  InstPrinter->printInst(&Sats, /*Address=*/0, /*Annot=*/"", *STI, SatsOS);
  SatsOS.flush();
  EXPECT_EQ(Printed, "\tsats\tr1 >> 2, 3");

  Printed.clear();
  raw_string_ostream SatuOS(Printed);
  InstPrinter->printInst(&Satu, /*Address=*/0, /*Annot=*/"", *STI, SatuOS);
  SatuOS.flush();
  EXPECT_EQ(Printed, "\tsatu\tr1 >> 2, 3");

  Printed.clear();
  raw_string_ostream SbcOS(Printed);
  InstPrinter->printInst(&Sbc, /*Address=*/0, /*Annot=*/"", *STI, SbcOS);
  SbcOS.flush();
  EXPECT_EQ(Printed, "\tsbc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SbrOS(Printed);
  InstPrinter->printInst(&Sbr, /*Address=*/0, /*Annot=*/"", *STI, SbrOS);
  SbrOS.flush();
  EXPECT_EQ(Printed, "\tsbr\tr1, 1");

  Printed.clear();
  raw_string_ostream StBPostIncOS(Printed);
  InstPrinter->printInst(&StBPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         StBPostIncOS);
  StBPostIncOS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1++, r2");

  Printed.clear();
  raw_string_ostream StBPreDecOS(Printed);
  InstPrinter->printInst(&StBPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         StBPreDecOS);
  StBPreDecOS.flush();
  EXPECT_EQ(Printed, "\tst.b\t--r1, r2");

  Printed.clear();
  raw_string_ostream StBDisp3OS(Printed);
  InstPrinter->printInst(&StBDisp3, /*Address=*/0, /*Annot=*/"", *STI,
                         StBDisp3OS);
  StBDisp3OS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1[3], r2");

  Printed.clear();
  raw_string_ostream StBDisp16OS(Printed);
  InstPrinter->printInst(&StBDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StBDisp16OS);
  StBDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StBIndexShiftOS(Printed);
  InstPrinter->printInst(&StBIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StBIndexShiftOS);
  StBIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StBEqDisp9OS(Printed);
  InstPrinter->printInst(&StBEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StBEqDisp9OS);
  StBEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.beq\tr1[3], r2");

  Printed.clear();
  raw_string_ostream StBAlDisp9OS(Printed);
  InstPrinter->printInst(&StBAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StBAlDisp9OS);
  StBAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.bal\tr1[3], r2");

  Printed.clear();
  raw_string_ostream StDPostIncOS(Printed);
  InstPrinter->printInst(&StDPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         StDPostIncOS);
  StDPostIncOS.flush();
  EXPECT_EQ(Printed, "\tst.d\tr1++, r2");

  Printed.clear();
  raw_string_ostream StDPreDecOS(Printed);
  InstPrinter->printInst(&StDPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         StDPreDecOS);
  StDPreDecOS.flush();
  EXPECT_EQ(Printed, "\tst.d\t--r1, r2");

  Printed.clear();
  raw_string_ostream StDRegOS(Printed);
  InstPrinter->printInst(&StDReg, /*Address=*/0, /*Annot=*/"", *STI, StDRegOS);
  StDRegOS.flush();
  EXPECT_EQ(Printed, "\tst.d\tr1, r2");

  Printed.clear();
  raw_string_ostream StDDisp16OS(Printed);
  InstPrinter->printInst(&StDDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StDDisp16OS);
  StDDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.d\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StDIndexShiftOS(Printed);
  InstPrinter->printInst(&StDIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StDIndexShiftOS);
  StDIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.d\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StHPostIncOS(Printed);
  InstPrinter->printInst(&StHPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         StHPostIncOS);
  StHPostIncOS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1++, r2");

  Printed.clear();
  raw_string_ostream StHPreDecOS(Printed);
  InstPrinter->printInst(&StHPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         StHPreDecOS);
  StHPreDecOS.flush();
  EXPECT_EQ(Printed, "\tst.h\t--r1, r2");

  Printed.clear();
  raw_string_ostream StHDisp3OS(Printed);
  InstPrinter->printInst(&StHDisp3, /*Address=*/0, /*Annot=*/"", *STI,
                         StHDisp3OS);
  StHDisp3OS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1[6], r2");

  Printed.clear();
  raw_string_ostream StHDisp16OS(Printed);
  InstPrinter->printInst(&StHDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StHDisp16OS);
  StHDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StHIndexShiftOS(Printed);
  InstPrinter->printInst(&StHIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StHIndexShiftOS);
  StHIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StHEqDisp9OS(Printed);
  InstPrinter->printInst(&StHEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StHEqDisp9OS);
  StHEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.heq\tr1[6], r2");

  Printed.clear();
  raw_string_ostream StHAlDisp9OS(Printed);
  InstPrinter->printInst(&StHAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StHAlDisp9OS);
  StHAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.hal\tr1[6], r2");

  Printed.clear();
  raw_string_ostream StWPostIncOS(Printed);
  InstPrinter->printInst(&StWPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         StWPostIncOS);
  StWPostIncOS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1++, r2");

  Printed.clear();
  raw_string_ostream StWPreDecOS(Printed);
  InstPrinter->printInst(&StWPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         StWPreDecOS);
  StWPreDecOS.flush();
  EXPECT_EQ(Printed, "\tst.w\t--r1, r2");

  Printed.clear();
  raw_string_ostream StWDisp4OS(Printed);
  InstPrinter->printInst(&StWDisp4, /*Address=*/0, /*Annot=*/"", *STI,
                         StWDisp4OS);
  StWDisp4OS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1[12], r2");

