cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream StWDisp16OS(Printed);
  InstPrinter->printInst(&StWDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StWDisp16OS);
  StWDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StWIndexShiftOS(Printed);
  InstPrinter->printInst(&StWIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StWIndexShiftOS);
  StWIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StWEqDisp9OS(Printed);
  InstPrinter->printInst(&StWEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StWEqDisp9OS);
  StWEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.weq\tr1[12], r2");

  Printed.clear();
  raw_string_ostream StWAlDisp9OS(Printed);
  InstPrinter->printInst(&StWAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StWAlDisp9OS);
  StWAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.wal\tr1[12], r2");

  Printed.clear();
  raw_string_ostream StcondOS(Printed);
  InstPrinter->printInst(&Stcond, /*Address=*/0, /*Annot=*/"", *STI,
                         StcondOS);
  StcondOS.flush();
  EXPECT_EQ(Printed, "\tstcond\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StdspOS(Printed);
  InstPrinter->printInst(&Stdsp, /*Address=*/0, /*Annot=*/"", *STI, StdspOS);
  StdspOS.flush();
  EXPECT_EQ(Printed, "\tstdsp\tsp[12], r2");

  Printed.clear();
  raw_string_ostream SthhWDisp8OS(Printed);
  InstPrinter->printInst(&SthhWDisp8, /*Address=*/0, /*Annot=*/"", *STI,
                         SthhWDisp8OS);
  SthhWDisp8OS.flush();
  EXPECT_EQ(Printed, "\tsthh.w\tr1[12], r2:t, r3:b");

  Printed.clear();
  raw_string_ostream SthhWIndexShiftOS(Printed);
  InstPrinter->printInst(&SthhWIndexShift, /*Address=*/0, /*Annot=*/"",
                         *STI, SthhWIndexShiftOS);
  SthhWIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tsthh.w\tr1[r4 << 3], r2:t, r3:b");

  Printed.clear();
  raw_string_ostream StswpHDisp12OS(Printed);
  InstPrinter->printInst(&StswpHDisp12, /*Address=*/0, /*Annot=*/"", *STI,
                         StswpHDisp12OS);
  StswpHDisp12OS.flush();
  EXPECT_EQ(Printed, "\tstswp.h\tr1[-2], r2");

  Printed.clear();
  raw_string_ostream SubhhWOS(Printed);
  InstPrinter->printInst(&SubhhW, /*Address=*/0, /*Annot=*/"", *STI,
                         SubhhWOS);
  SubhhWOS.flush();
  EXPECT_EQ(Printed, "\tsubhh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream StswpWDisp12OS(Printed);
  InstPrinter->printInst(&StswpWDisp12, /*Address=*/0, /*Annot=*/"", *STI,
                         StswpWDisp12OS);
  StswpWDisp12OS.flush();
  EXPECT_EQ(Printed, "\tstswp.w\tr1[-4], r2");

  Printed.clear();
  raw_string_ostream ScallOS(Printed);
  InstPrinter->printInst(&Scall, /*Address=*/0, /*Annot=*/"", *STI, ScallOS);
  ScallOS.flush();
  EXPECT_EQ(Printed, "\tscall");

  Printed.clear();
  raw_string_ostream SscallOS(Printed);
  InstPrinter->printInst(&Sscall, /*Address=*/0, /*Annot=*/"", *STI,
                         SscallOS);
  SscallOS.flush();
  EXPECT_EQ(Printed, "\tsscall");

  Printed.clear();
  raw_string_ostream ScrOS(Printed);
  InstPrinter->printInst(&Scr, /*Address=*/0, /*Annot=*/"", *STI, ScrOS);
  ScrOS.flush();
  EXPECT_EQ(Printed, "\tscr\tr1");

  Printed.clear();
  raw_string_ostream SrEqOS(Printed);
  InstPrinter->printInst(&SrEq, /*Address=*/0, /*Annot=*/"", *STI, SrEqOS);
  SrEqOS.flush();
  EXPECT_EQ(Printed, "\tsreq\tr1");

  Printed.clear();
  raw_string_ostream SrAlOS(Printed);
  InstPrinter->printInst(&SrAl, /*Address=*/0, /*Annot=*/"", *STI, SrAlOS);
  SrAlOS.flush();
  EXPECT_EQ(Printed, "\tsral\tr1");

  Printed.clear();
  raw_string_ostream SleepOS(Printed);
  InstPrinter->printInst(&Sleep, /*Address=*/0, /*Annot=*/"", *STI, SleepOS);
  SleepOS.flush();
  EXPECT_EQ(Printed, "\tsleep\t1");

  Printed.clear();
  raw_string_ostream SsrfOS(Printed);
  InstPrinter->printInst(&Ssrf, /*Address=*/0, /*Annot=*/"", *STI, SsrfOS);
  SsrfOS.flush();
  EXPECT_EQ(Printed, "\tssrf\t1");

  Printed.clear();
  raw_string_ostream SubOS(Printed);
  InstPrinter->printInst(&Sub, /*Address=*/0, /*Annot=*/"", *STI, SubOS);
  SubOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2");

  Printed.clear();
  raw_string_ostream SubImm8OS(Printed);
  InstPrinter->printInst(&SubImm8, /*Address=*/0, /*Annot=*/"", *STI,
                         SubImm8OS);
  SubImm8OS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, -1");

  Printed.clear();
  raw_string_ostream SubSPImm8OS(Printed);
  InstPrinter->printInst(&SubSPImm8, /*Address=*/0, /*Annot=*/"", *STI,
                         SubSPImm8OS);
  SubSPImm8OS.flush();
  EXPECT_EQ(Printed, "\tsub\tsp, -4");

  Printed.clear();
  raw_string_ostream SubShiftOS(Printed);
  InstPrinter->printInst(&SubShift, /*Address=*/0, /*Annot=*/"", *STI,
                         SubShiftOS);
  SubShiftOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2, r3 << 2");

  Printed.clear();
  raw_string_ostream SubRegImm16OS(Printed);
  InstPrinter->printInst(&SubRegImm16, /*Address=*/0, /*Annot=*/"", *STI,
                         SubRegImm16OS);
  SubRegImm16OS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream SubImmOS(Printed);
  InstPrinter->printInst(&SubImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SubImmOS);
  SubImmOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, -1");

  Printed.clear();
  raw_string_ostream SubEqOS(Printed);
  InstPrinter->printInst(&SubEq, /*Address=*/0, /*Annot=*/"", *STI, SubEqOS);
  SubEqOS.flush();
  EXPECT_EQ(Printed, "\tsubeq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SubAlOS(Printed);
  InstPrinter->printInst(&SubAl, /*Address=*/0, /*Annot=*/"", *STI, SubAlOS);
  SubAlOS.flush();
  EXPECT_EQ(Printed, "\tsubal\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SubEqImmOS(Printed);
  InstPrinter->printInst(&SubEqImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SubEqImmOS);
  SubEqImmOS.flush();
  EXPECT_EQ(Printed, "\tsubeq\tr1, -1");

